# Pandas Dataframes
## What are they and why do we want them?

Pandas is an open source project that provides Python with some very much welcomed data structures that make data anlaysis far easier. If you've worked with R before, you know precisely what a dataframe is and have a general sense of how to get around one. If you haven't, don't worry! The goal of this session is to get you up to speed with using Pandas in Python. It takes some getting used to at first but after a little time, it should start to make some sense.

The term dataframe is a little nebulous and offputting if you're new to this sort of thing but in reality a dataframe is nothing more than what you're use to seeing in Excel. (Okay, so this isn't entirely true. Pandas does offer a great deal more than what Excel does but the general idea stands. Dataframes can be thought of as tables in Excel more or less when you're getting started)

Lets jump right in with importing Pandas and get up and running with one of the provided toy datasets.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns # We're only bringing in seaborn for it's sample data here
from math import floor

In [2]:
print(sns.get_dataset_names())

C:\Users\Downi\miniconda3\envs\gdsp_tutorials\lib\site-packages\seaborn\utils.py:384: GuessedAtParserWarning: No parser was explicitly specified, so I'm using the best available HTML parser for this system ("html.parser"). This usually isn't a problem, but if you run this code on another system, or in a different virtual environment, it may use a different parser and behave differently.

The code that caused this warning is on line 384 of the file C:\Users\Downi\miniconda3\envs\gdsp_tutorials\lib\site-packages\seaborn\utils.py. To get rid of this warning, pass the additional argument 'features="html.parser"' to the BeautifulSoup constructor.

  gh_list = BeautifulSoup(http)

['anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'exercise', 'flights', 'fmri', 'gammas', 'geyser', 'iris', 'mpg', 'penguins', 'planets', 'tips', 'titanic']

In [3]:
sns.load_dataset('titanic').head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Two things to notice here . . .
- The dataset that is returned here is tabular looking (that is a Pandas dataframe)
- The second is the .head() method. This is a method available to Pandas dataframes (and series) that will tell you the top 5 (or n) values in a dataframe. It's useful if you're data is big and you just want to see a small portion of it.
  - Likewise there is a tail function that operates from the bottom.

### Okay, so we can load seaborn's built in data but what about a csv (or other data formats).
Pandas can natively read the following formats.
- CSV
- JSON
- HTML
- Your local clipboard
- Microsoft Excel
- Open Document (the open source excel)
- HDF5
- Feather
- Parquet
- Msgpack
- Stata
- SAS
- Python Pickles (Sounds strange but is actually really cool. For you R users out there, this is Python's equivelant of an RData file).
- SQL
- Google Big Query

See here for the full list and documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html

I've downloaded the titanic data from the seaborns data repository (https://github.com/mwaskom/seaborn-data) so we can use the read_csv function ourselves.

In [4]:
# while we're here let's see how to write a csv as well.
data = sns.load_dataset('titanic')
type(data)

pandas.core.frame.DataFrame

In [5]:
data.to_csv('./data/titanic.csv', index=False) # index set to false keeps us from writing the row index to csv

In [6]:
# now, let's read it back.
myData = pd.read_csv('./data/titanic.csv')
print(type(myData))
myData.head()

<class 'pandas.core.frame.DataFrame'>

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### I had mentioned data strucutres (It was supposed to be plural)
Pandas has the notion of a few data structures, these structures include the following.
- Dataframes (which we've already seen)
- Series (which, technically we've already seen, you just may not realize it yet)

If you want some deeper reading on Pandas data structures, check out https://pandas.pydata.org/pandas-docs/stable/getting_started/dsintro.html

### So what is this Series we just mentioned?
A dataframe consists of columns and rows, these columns or rows can be had as one dimensional arrays (i.e. Series). Let's take a look at the first column and I'll prove it's a series.

In [7]:
print(type(myData['survived'])) # notice that the type is a series. Remember back to when we worked with numpy arrays? 
print(myData['survived'].head())

<class 'pandas.core.series.Series'>
0    0
1    1
2    1
3    1
4    0
Name: survived, dtype: int64

Two things are presented by the previous example
- The first and most obvious is subsetting of columns and rows.
- The second and slightly less obvious is the series data type. That column should be boolean but it is being represented as an int64! We can clean this up in two ways but we'll get to that after we deal with the first matter.

### Slicing and Dicing in Pandas
Learning how to get the data you want out of a Pandas dataframe can be a little frustrating at first but let's step through your options.
- loc (standing for location) - Intended to be used with labels
- iloc (standing for index location) - intended to be used with index values
- index names (i.e. columns or rows) - kind of a shortcut if you're after a particular column or row
- dot notation - similar in a lot of ways to R's $ notation

In [8]:
# First up, loc
print(
    myData.loc[0:5, 'survived']
) # select your rows, and then you're columns

# this get's to be pretty handy when you want to filter your data. (There is a filter function but we'll ignore that here.)
print(
    myData.loc[0:5, 'survived'] == 0
)
# the above gets us what is typically referred to as a mask. It provides a way to "mask" our data with the boolean series and get only those that are true.
mask = myData.loc[0:5, 'survived'] == 0
tmp = myData.loc[0:5, :]

tmp.loc[mask.values, :]

0    0
1    1
2    1
3    1
4    0
5    0
Name: survived, dtype: int64
0     True
1    False
2    False
3    False
4     True
5     True
Name: survived, dtype: bool

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [9]:
# now for iloc
myData.iloc[0:5, 0] # again, we're getting the first 5 from the survived column
# iloc isn't going to work with labels though

0    0
1    1
2    1
3    1
4    0
Name: survived, dtype: int64

In [10]:
# with particular column names
print(myData['survived'].head(6))

0    0
1    1
2    1
3    1
4    0
5    0
Name: survived, dtype: int64

In [11]:
# and finally dot notation
myData.survived.head(6)

0    0
1    1
2    1
3    1
4    0
5    0
Name: survived, dtype: int64

Now, let's work with the series data and change the datatype of the survived column

In [12]:
print(myData['survived'].head(6))
type(myData['survived']) # it is in fact a series

0    0
1    1
2    1
3    1
4    0
5    0
Name: survived, dtype: int64

pandas.core.series.Series

In [13]:
print(myData['survived'].astype('bool').head())
# a full list of pandas data types can be found here https://pbpython.com/pandas_dtypes.html
myData.head()
# It didn't change! What gives? . . . We never reassigned the column with the new info.

0    False
1     True
2     True
3     True
4    False
Name: survived, dtype: bool

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [14]:
myData['survived'] = myData['survived'].astype('bool')
myData.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,True,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,True,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,True,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,False,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

We could have (and probably should have) initialized our data with a specific data type. Let's do that now.

In [15]:
typedData = pd.read_csv('./data/titanic.csv', dtype={'survived':'bool'})
typedData.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,False,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,True,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,True,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,True,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,False,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Some notes on using Pandas
In general you really don't want to grow dataframes in a loop. This will be slow and often times won't work if you have big enough datasets (it doesn't take much). The reason being is that the dataframe gets copied a lot when used in loops often times. This leads to memory usage getting out of hand quite quickly.

Instead, keep in mind some of the things we learned in numpy. Try to stick to vectorized operations where possible. If you have to loop in a dataframe for any reason, pre-allocate the column or dataframe first that you'll be filling.

In [16]:
pd.DataFrame(index=range(0,10), columns=['column1', 'column2'])

  column1 column2
0     NaN     NaN
1     NaN     NaN
2     NaN     NaN
3     NaN     NaN
4     NaN     NaN
5     NaN     NaN
6     NaN     NaN
7     NaN     NaN
8     NaN     NaN
9     NaN     NaN

## Data Science Oriented Functionality
Up to this point we've dealt with a lot of the bare basics of working with Pandas dataframes at the expense of functionality that one would typically use in a data analytics or data science capacity. We'll work on fixing that going forward. We'll work through grouping data, aggregation, and data imputation. This is a very cursory run through but will hopefully give you a feel for doing some of the most basic analytic tasks in Pandas.

### Group By
Sometimes we want to calculate some information by categories. For example, in our Titanic dataset, perhaps we want to know the average age by male and female groups. With a pandas group by method, this is a very simple calculation. I'd strongly encourage you to try different groupings and calculations, perhaps even moving on to visualizing some of these grouped summaries.

In [17]:
data.groupby('sex')

Notice what the result of the groupby operation is, it's a special type of dataframe. This dataframe is encoded to let Python know that the data is grouped into "Male" and "Female" categories. We can take this and determine the average age of the "Male" and "Female" populations=

The way we will do below groups by the sex column and then selects the age column to perform the mean.

In [18]:
data.groupby('sex')['age'].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

If we don't specify the column we want to take the mean of then Pandas is intelligent enough to just return all the numeric columns that it was possible to perform the mean calculation on.

In [19]:
data.groupby('sex').mean()

,survived,pclass,age,sibsp,parch,fare,adult_male,alone
sex,,,,,,,,
female,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818,0.000000,0.401274
male,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893,0.930676,0.712305

### Data Imputation

Another common data science task is dealing with data imputation. There are a massive variety of ways to deal with missing values. This section will not be comprehensive in any way but will at least make you aware of this common necessity. If you have any missing values in your data (which you likely will at some point), you'll need to make a decision. Do you delete the data (possibly losing valuable information) or do you try to approximate it? If you do try and approximate it, what way is most appropriate? A simple mean, a linear regression model, a naive forecast, the mean, the mode? It really just depends on your data. As with many things in the realm of data science, it just depends on the data and you as the scientist have to make a decision based on the information you have available to you. Get creative and do lots of reading, learning is key to figuring out a workable direction to move with regards to imputation. There often isn't a "right" answer, it's typically a set of good answers that require understanding of the limitations of each of the possible choices.

Fortunately in our Titanic dataset that we're already using, there are some missing values for us to work with. Let's identify the missing values first. We can verify if there are any missing values at all with the following command. The next cell will help us identify which columns have missing values and how many.

In [20]:
data.isnull().values.any()

True

In [21]:
data.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

What percentage of the data is null in each of these columns? This is a good question to ask, is it a large proportion of our sample population or is it a miniscule amount?

In [22]:
# len(data) is also a valid way of getting the number of dataframe rows but we'll opt for the more flexible shape function (more flexible because it gets you the columns as well).
round(data.isnull().sum()/data.shape[0] * 100, 2)

survived        0.00
pclass          0.00
sex             0.00
age            19.87
sibsp           0.00
parch           0.00
fare            0.00
embarked        0.22
class           0.00
who             0.00
adult_male      0.00
deck           77.22
embark_town     0.22
alive           0.00
alone           0.00
dtype: float64

Sweet! We now know that nearly 20% of the age data is missing, 77% of the deck data is missing, and .22% of the embarked and embarked town data is missing. Let's work on imputing the age data. It will be the simplest columns to try to impute. There are definitely methods for imputing categorical variables like deck (the most eggregious offender when it comes to missing values in this data) but I will leave this as an exercise for you to stretch yourself on.

To get started with imputing the age we need to decide how we could go about it. We could just take a simple mean of all of the data and fill it in but I think we can do a lot better than that. We just discussed grouping data. We could use groups to calculate means for each group and then back fill the missing values with those mean values. Notice that there is a sex and who column, take a look at the unique values for each.

In [23]:
print(data.sex.unique())
print(data.who.unique())

['male' 'female']
['man' 'woman' 'child']

We have man, female, man, woman, and child. Neither of these columns have any missingness. While there is some overlap between male/man and female/woman, we get a second category that may be useful here, child. Let's group our data by these two columns and calculate the mean for age.

In [24]:
dataImputation = pd.DataFrame(data.groupby(['sex', 'who'])['age'].mean())
dataImputation

                    age
sex    who
female child   7.209302
       woman  32.000000
male   child   5.466750
       man    33.173123

From this we were able to figure out that the average female child is 7 years old and the average woman is 32 years old.

For men, the male child's average age was 5 and the average adult male was 33.

This further stratifies our data beyond just a simple average and can give us a little more confidence in our imputated values. Let's backfill these missing values! Keep in mind that the data frame we created has a multi index (i.e. two or more indicies). We'll use loc to refer to the location we're interested in.

In [25]:
data.loc[(data['sex']=='female') & (data['who'] == 'child') & (data['age'].isnull()), 'age'] = dataImputation.loc[('female', 'child')][0]
data.loc[(data['sex']=='female') & (data['who'] == 'woman') & (data['age'].isnull()), 'age'] = dataImputation.loc[('female', 'woman')][0]
data.loc[(data['sex']=='male') & (data['who'] == 'child') & (data['age'].isnull()), 'age'] = dataImputation.loc[('male', 'child')][0]
data.loc[(data['sex']=='male') & (data['who'] == 'man') & (data['age'].isnull()), 'age'] = dataImputation.loc[('male', 'man')][0]

In [26]:
round(data.isnull().sum()/data.shape[0] * 100, 2)

survived        0.00
pclass          0.00
sex             0.00
age             0.00
sibsp           0.00
parch           0.00
fare            0.00
embarked        0.22
class           0.00
who             0.00
adult_male      0.00
deck           77.22
embark_town     0.22
alive           0.00
alone           0.00
dtype: float64

Success! There is 0% of the age data that is missing now. There are a few things to discuss from our imputation though. The masking method and the use of loc.

Let's discuss the masking method and loc together as they go hand in hand. the loc method is intended to access a set of columns by a boolean array or set of column names. Given that we wanted to acess one particular column (age) under a certain scenario (female/child and null, male/child and null, etc), loc was appropriate to use and allowed us to set a value for all of these rows in the age column in one line. Check out the next cell and you'll see what I mean by a boolean array. The idea is to create a set of True and False values, indicating that we only want to keep the rows that are returned as True.

In [27]:
(data['sex']=='female') & (data['who'] == 'child') & (data['age'].isnull())

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Length: 891, dtype: bool